#4.จงเขียนโปรแกรมPython ของโปรแกรมแก้สมการ y = 2x2+ 2x + 1 เมื อ x คือค่าที รับทางแป้นพิมพ์ และแสดงผลจากการแก้สมการ y ที ได้ทางหน้าจอ

def ID( ) :
    x = float(input('x = '))
    return x

def XY( x ) :
    y = (( 2 * ( x * x )) + ( 2 * x ) + 1 )
    return y

def YA( x, y ) :
    print(f'y = ( 2  * ( {x:.0f} * {x:.0f} )) + ( 2 * {x:.0f} ) + 1')
    print(f'ตอบ : {y:.0f}')

print('---------------------------------------------')
print('-------------- โปรแกรมแก้สมการ ---------------')
print('---------------------------------------------')
x = ID( )
y = XY( x )
print('---------------------------------------------')
YA( x, y )
print('---------------------------------------------')